app/Controllers/assemblyController.php

    public function index()
    {
        $db        = db_connect('default');
        $assemblyModel = model('assemblyModel', true, $db);
        $items['items'] = $assemblyModel->findAll();
---
SELECT *
FROM `assembly`
WHERE `assembly`.`deleted_at` IS NULL

    public function detail()
    {
        $db        = db_connect('default');
        $assemblyModel = model('assemblyModel', true, $db);
        $id = $this->request->getPostGet('id');
        $item['item'] = $assemblyModel->find($id);
---
SELECT *
FROM `assembly`
WHERE `assembly`.`deleted_at` IS NULL
AND `assembly`.`assembly_id` = '1'

    public function save()
    {
        $db        = db_connect('default');
        $assemblyModel = model('assemblyModel', true, $db);
        $data = array(
            'name' => $this->request->getPostGet('name'),
            'place' => $this->request->getPostGet('place')
        );
        if ($this->request->getPostGet('assembly_id')) {
            $data['assembly_id'] = $this->request->getPostGet('assembly_id');
        }

        $assemblyModel->save($data);
---
INSERT INTO `assembly` (`name`, `place`, `created_at`, `updated_at`) VALUES ('Asamblea 1', '123', '2022-10-02 22:23:42', '2022-10-02 22:23:42')