app/Controllers/common_areaController.php

    public function index()
    {
        //Connect / models
        $db        = db_connect('default');
        $common_areaModel = model('common_areaModel', true, $db);
        //Get-fill data
        $items['items'] = $common_areaModel->findAll();
---
SELECT *
FROM `common_area`
WHERE `common_area`.`deleted_at` IS NULL