app/Controllers/loginController.php

	public function signin()
	{
		$db        = db_connect('default');
		$email = $this->request->getPostGet('email');
		$password = md5($this->request->getPostGet('password'));

		$administratorModel = model('administratorModel', true, $db);
		if ($data = $administratorModel->where('email', $email)->first()) {
			if ($data['password'] == $password) {
				$data['isLoggedIn'] = true;
				$data['type'] = "administrator";
				session()->set($data);
				return redirect()->to('/home');
			} else {
				$this->seterror("Inicio de sesión incorrecto para usuario administrador.");
				return redirect()->to('/login');
			}
		}

		$relativeModel = model('relativeModel', true, $db);
		if ($data = $relativeModel->where('email', $email)->first()) {
---
SELECT *
FROM `administrator`
WHERE `email` = 'ceciliano@synappcr.com'
AND `administrator`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `relative`
WHERE `email` = 'ceciliano@synappcr.com'
AND `relative`.`deleted_at` IS NULL
 LIMIT 1

		}

		$condo_ownerModel = model('condo_ownerModel', true, $db);
		if ($data = $condo_ownerModel->where('email', $email)->first()) {
---
SELECT *
FROM `condo_owner`
WHERE `email` = 'ceciliano@synappcr.com'
AND `condo_owner`.`deleted_at` IS NULL
 LIMIT 1