app/Controllers/relativeController.php

SELECT *
FROM `relative`
WHERE `relative`.`deleted_at` IS NULL
SELECT *
FROM `condo_owner`
WHERE `condo_owner`.`deleted_at` IS NULL
---
    public function index()
    {
        //Connect / models
        $db        = db_connect('default');
        $relativeModel = model('relativeModel', true, $db);
        $condo_ownerModel = model('condo_ownerModel', true, $db);
        //Get-fill data
        $items['items'] = $relativeModel->findAll();
        $items['relations'] =  $condo_ownerModel->findAll();

SELECT *
FROM `relative`
WHERE `relative`.`deleted_at` IS NULL
AND `relative`.`relative_id` = '4'
SELECT *
FROM `condo_owner`
WHERE `condo_owner`.`deleted_at` IS NULL
---
    public function profile($error = null, $data = null)
    {
        //Connect / models
        $db        = db_connect('default');
        $relativeModel = model('relativeModel', true, $db);
        $condo_ownerModel = model('condo_ownerModel', true, $db);
        //Get-fill data
        if ($data == null) {
            $id = $this->request->getPostGet('id');
            $items['item'] = $relativeModel->find($id);
            $items['item']['password'] = '';
            $items['error'] =  $error;
        } else {
            $items['item'] = $data;
            $items['item']['password'] = '';
            $items['error'] =  $error;
        }
        $items['relations'] =  $condo_ownerModel->findAll();