app/Controllers/reservationController.php

    public function common_areas()
    {
        //Connect / models
        $common_areaModel = model('common_areaModel', true, $db);
        //Get-fill data
        $items['items'] = $common_areaModel->findAll();
---
SELECT *
FROM `common_area`
WHERE `common_area`.`deleted_at` IS NULL

    public function request($data = null)
    {
        //Connect / models
        $reservationModel = model('reservationModel', true, $db);
        $common_areaModel = model('common_areaModel', true, $db);
        $condo_ownerModel = model('condo_ownerModel', true, $db);
        $relativeModel = model('relativeModel', true, $db);
        $id = $this->request->getPostGet('id');
        //Get-fill data
        if ($data != null) {
            $items['error'] = $data['error'];
            $id = $data['common_area_id'];
        } else {
            $id = $this->request->getPostGet('id');
        }
        $items['item'] = $common_areaModel->find($id);
        $items['reservations'] =  $reservationModel->findAll();
        $items['relations'] =  $common_areaModel->findAll();
        $items['relations2'] =  $condo_ownerModel->findAll();
        $items['relations3'] =  $relativeModel->findAll();
---
SELECT *
FROM `common_area`
WHERE `common_area`.`deleted_at` IS NULL
SELECT *
FROM `condo_owner`
WHERE `condo_owner`.`deleted_at` IS NULL
SELECT *
FROM `relative`
WHERE `relative`.`deleted_at` IS NULL