app/Controllers/voteController.php

    public function new()
    {
        //Connect / models
        $voteModel = model('voteModel', true, $db);
        $assembly_votingModel = model('assembly_votingModel', true, $db);
        $condo_ownerModel = model('condo_ownerModel', true, $db);
        //Get-fill data
        $items['relations'] =  $assembly_votingModel->findAll();
        $items['relations2'] =  $condo_ownerModel->findAll();
---
SELECT *
FROM `assembly_voting`
WHERE `assembly_voting`.`deleted_at` IS NULL
SELECT *
FROM `condo_owner`
WHERE `condo_owner`.`deleted_at` IS NULL